class Solution {
    public long solution(int n) {
        long answer = 0;
        
        
        int dp[] = new int[20000];
        
        dp[0] = 1;
        dp[1] = 2;
        
        for(int i = 2; i < 20000; i ++){
            dp[i] = (dp[i - 1] + dp[ i -2]) % 1234567;
        }
        
        return dp[n -1] ;
        
        // 4 
        // 2 2 
        // 1 1 2 
        // 2 1 1
        // 1 1 1 1
        // 1 2 1 
        
        // 1 1 1 1 
        // 2 1 1
        // 1 2 1
        // 1 1 2 
        // 2 2 
        
        // 슬라이딩 윈도우 방식을 활용해서 최적화 ?? 
        // dp 방식 체택? 
        
        // 1 2 3 4 5 6. 
        // 1 2 3 5 8 
        
        // 5을 만드는 방법 
        
        // 1 1 1 1 1
        // 2 1 1 1
        // 1 2 1 1
        // 1 1 2 1
        // 1 1 1 2
        // 2 2 1
        // 2 1 2
        // 2 2 1
        // dp 방식이 아니라는 사실을 알게 되었음 
        
        
    }
}